In [1]:
import pandas as pd

In [3]:
## Lista
data = [["Juan", 25], ["María", 30], ["Pedro", 40]]
print(type(data))

<class 'list'>

In [5]:
df = pd.DataFrame(data, columns = ["Nombre", "Edad"])

In [6]:
df

  Nombre  Edad
0   Juan    25
1  María    30
2  Pedro    40

In [10]:
## Diccionario
data = {"Nombre": ["Juan", "María", "Raul"], 
        "Edad": [25, 30, 28]}
print(type(data))

<class 'dict'>

In [11]:
df = pd.DataFrame(data)

In [12]:
df

  Nombre  Edad
0   Juan    25
1  María    30
2   Raul    28

In [13]:
## Lista de tuplas
data = (["Juan", 25], ["María", 30], ["Pedro", 40])

In [14]:
df = pd.DataFrame(data, columns = ["Nombre", "Edad"])

In [15]:
df

  Nombre  Edad
0   Juan    25
1  María    30
2  Pedro    40

In [4]:
df = pd.read_csv("../data/data", sep = "|")

In [5]:
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [8]:
df = pd.read_csv("../data/data.csv")

In [9]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [16]:
df = pd.read_csv("../data/data_without_header", header = None, names = ["nombre", "edad", "ciudad"])

In [17]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [18]:
df = pd.read_json("../data/data.json")

In [19]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [20]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [21]:
df.head(2)

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [23]:
df.tail(2)

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [24]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [25]:
df.shape

(3, 3)

In [27]:
df["nombre"]

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [28]:
df[["nombre", "edad"]]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [29]:
df.loc[0]

nombre      Juan
edad          25
ciudad    Madrid
Name: 0, dtype: object

In [30]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [31]:
df[df["edad"] > 30]

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [3]:
data = {"grupo": ["A", "B", "A", "B", "A", "B"],
       "valor": [10, 15, 25, 12, 27, 33]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  grupo  valor
0     A     10
1     B     15
2     A     25
3     B     12
4     A     27
5     B     33

In [6]:
df.groupby("grupo").mean()

           valor
grupo
A      20.666667
B      20.000000

In [7]:
df.groupby("grupo").sum()

       valor
grupo
A         62
B         60

In [6]:
import numpy as np

In [7]:
data = {"A": [1,2,np.nan,4],
        "B": [4,np.nan,5,7]}
df = pd.DataFrame(data)

In [13]:
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  5.0
3  4.0  7.0

In [15]:
df_lleno = df.fillna(value = '0')
df_lleno

     A    B
0  1.0  4.0
1  2.0    0
2    0  5.0
3  4.0  7.0

In [16]:
df_sin_na = df.dropna()
df_sin_na

     A    B
0  1.0  4.0
3  4.0  7.0

In [17]:
def suma(a, b):
    return a + b

In [18]:
df["suma"] = df["A"] + df["B"]
df

     A    B  suma
0  1.0  4.0   5.0
1  2.0  NaN   NaN
2  NaN  5.0   NaN
3  4.0  7.0  11.0

In [19]:
df["dobleA"] = df["A"].apply(lambda x: x * 2)
df

     A    B  suma  dobleA
0  1.0  4.0   5.0     2.0
1  2.0  NaN   NaN     4.0
2  NaN  5.0   NaN     NaN
3  4.0  7.0  11.0     8.0

In [20]:
def doble(x):
    return x * 2

In [21]:
df["dobleB"] = df["B"].apply(doble)
df

     A    B  suma  dobleA  dobleB
0  1.0  4.0   5.0     2.0     8.0
1  2.0  NaN   NaN     4.0     NaN
2  NaN  5.0   NaN     NaN    10.0
3  4.0  7.0  11.0     8.0    14.0

In [8]:
df["suma2"] = df.apply(lambda row: row["A"] + row["B"], axis = 1)
df

     A    B  suma2
0  1.0  4.0    5.0
1  2.0  NaN    NaN
2  NaN  5.0    NaN
3  4.0  7.0   11.0